import { characterColors } from './constants/colors';
import { images } from './constants/images';

export const characters = {
  migel: {
    name: "미겔 / Migel",
    realname: "Migeldoran Eternos Ozan Colddew",
    color: characterColors.migel.primary,
    title: "다 같이 뛰어!",
    portrait: images.characters.migel.portrait,

    appearance: {
      image: images.characters.migel.full,
      hoverImage: images.characters.migel.full2,
      description: `‘야성의 미(美)’를 묘사해보자. 잔파도처럼 굽슬거리며 내려오는 고동색 머리칼, 짙은 눈썹과 까만 눈동자···가 아니라 이건··· 색안경?! 따지자면 그는 야성의 미(美)가 아닌 미친 사람에 가까운 인상이다. 자유롭다 못해 헝클어진 머리카락, 제대로 된 행색이라는 걸 갖추지 못한 코트, 뜯겨나간듯한 소매··· 이뿐인가? 양팔을 한껏 감은 붕대와 거대한 황금빛 버클까지 여러분의 시선을 기다린다. 그의 개성인지, 혹은 유일한 영광을 뽐내려는 진심인지 버클에는 ‘THE WORLD’S BEST BARD’라고 새겨져있다. 겉으로 보기에도 존재감이 강한 그는 개의치 않고 부츠를 무릎까지 끌어올리며 굽을 부딪힌다. 눈의 생김새가 보이지 않아도 장난스레 올린 입꼬리에서 천성이 드러난다. 뭐가 그리 신나는지 9할은 늘 웃고 있는 얼굴이다. 정확히는, 몸 안에서 근질거리는 박자감을 참지 못하는 표정이다.`,
    },

    description: {
      job: "바드 / Bard",
      body: "171cm / 평균",
      gender: "여",
      race: "훔",
      age: "25",
      enlistment_period: "원년 멤버",
      personality: `잡초 같은 / 굴하지 않는 / 자유분방 / 이상한 놈, 이상한 놈, 이상한 놈

                  하루, 아니, 한 시간만 함께해도 알 수 있다. 눈앞의 바드는 소위 말하는 ‘자유로운 영혼’이다. 그리고 눈에 뵈는 것이 없다. ‘이야기가 있다면 어디든 가고, 영감이 온다면 무엇이든 한다’가 그의 좌우명. 그 신념은 한없이 뻗어나가므로 죽음조차 그를 막을 자의 이름이 되지 못한다. 명계를 다스리는 신 앞에서도 신나게 발을 움직이며 류트를 칠 테니 말이다. 그렇게 생각하면 그는 타고났다.   

                  타고난 음유시인이자, 세상을 기록하는 방랑자이고··· 이상한 놈이다. 
                  `,
      etc: `[베리 파수꾼의 원년 바드]
          베리 파수꾼에 입단한 지 어느덧 9년의 세월이 지났다. 9년 전 그는 고작 열여섯밖에 안되는 애송이였다. 물론 애송이였음에도 자신이 세상에서 제일 가는 음유시인이라고 생각했다. (지금도 그렇지만!) 바드로 태어난 자, 죽을 때까지 걷고 걸으리라. 그리고 노래하리라. 이 세상에서 눈을 뜬 후 온갖 시구로 호흡하며 열여섯 번의 해를 보내자, 그의 입은 더욱 근질거리기 시작했다. 명곡을 노래하기 위해선 대서사시를 겪어야 하기 마련. 그렇게 그는 호기롭게 베리 파수꾼의 일원이 되겠노라 말했다. 아주(Very, not Berry) 좋은 모험단이라고 생각했기 때문이다. 나름 젊은 치기를 내세운 것이었다만 당시 그는 지금과 얼굴이 똑같았다. 노안이었던 그를 성인으로 착각한 제타 덕에 당당히 입단하게 되었다. 그저 철없는 어른처럼 보였다 할지라도 질풍노도의 시기를 베리 파수꾼과 함께한 것이나 다름없다. 어렸던 그는 지금보다 더 불같았다는 소문이 있다. 그게 긍정적인 의미인지, 부정적인 의미인지는 알 수 없지만···

          [검을 든 바드]
          망토처럼 긴 코트 뒷자락에는 검이 한 자루 숨겨져 있다 - 그렇다. 그는 ‘검’을 사용하는 바드였던 것이다··· 평소 모습을 보면 검을 다루기는커녕 제대로 잡지도 못할 것 같지만, 제법 훌륭한 검술사다. 어디서 검을 익혔냐 물어도 ‘검날은 류트의 현과 같다. 나는 연주하고, 검은 날카로운 음을 낸다. 그러면 우리는 신나서 춤을 춘다.’라고만 말한다. 종종 다른 이가 등을 쳤다가 의문 모를 딱딱함에 놀란 표정을 지으면 자신의 등 근육이 어떠냐며 농담 치는 걸 좋아한다. 뽑아 든 검이 옷에 걸려 모양새가 영 멋지지 않을 때가 있다. 그럴 땐 류트로 내려친다. 류트를 소중히 여기진 않냐고? 파괴가 환호를 부르는 공연이 된다면 그는 주저하지 않는다. 결국 중요한 것은 류트보다 한 닢의 영감(금화일지도?), 관객의 표정, 그리고 노래하는 나, 미겔이니까!

          [소매는 어디로 갔는가]
          어느 시골 동네의 염소와의 음역대 대결에서 처참히 패배하고 물어뜯겼다. 소매가 물어뜯긴 자국은 마치 검사 등에 남은 큰 흉터와 같다. 이것은 바드의 수치라나, 뭐라나. 양쪽을 다 물어뜯긴 것인가 하면은··· 한쪽은 멋을 부리기 위한 목적으로 원래 뜯어져 있었다. 염소에게 져서 다른 쪽 소매도 날아가는 바람에 끝내 민소매가 됐다. 한쪽을 메꿔줄 옷소매를 절찬리에 모집 중이다.

          [THE WORLD’S BEST… BARD?]
          영웅에게 하사하는 온갖 금은보화 사이에서도 꿀리지 않을 듯한 존재감. 그것이 그가 차고 있는 벨트의 버클이다. 버클에는 ‘세계 최고의 바드’라고 새겨져 있는데, 도대체 언제, 어디서, 누가 미겔에게 하사한 것인지는 미지수다. 월드 바드 챔피언십이라도 있는 건가? …알 수 없다. 그래도 버클이 세계 최고의 바드라고 칭한 만큼 노래 실력은 상상 이상이다. 호소력이 짙은 목소리는 성난 말을 기쁘게 하고, 웃던 술집 주인을 눈물 흘리게 한다 이 말씀!

          [다 같이 뛰어!]
          왕이든, 백성이든, 기사든, 도둑이든! 모두를 즐겁게 하는 재주꾼 미겔은 늘 상대방보다 낮은 위치이기를 자처한다. 가끔 선율을 선보이다가 흥분하면 격식 없이 대할 때도 있지만, 음악 앞에선 모두 공평한 법 아니겠는가? 

          [그의 ‘진명’]
          미겔의 풀네임은 ‘미겔도란 에테르노스 오잔 콜드듀’다. 대충 ‘선율을 노래하는 영원한 방랑자 음유시인 콜드듀’라는 뜻이다. 어떤 이들은 콜드듀를 쿨 듀드(cool dude)라고 잘못 알아듣기도 한다. 본인이 지은 이름일까? 누가··· 지은 이름일까.
          `,
      belongings: `류트 / (코트 뒷자락에 가려진) 검 / 여분의 붕대 / 여분의 류트 줄 / 가죽 수첩과 짧은 깃펜`
    },
    quotes: ["다 같이 뛰어!"],
    weapon: images.characters.migel.weapon,
    stats: [
      { label: "힘", value: "◆◆◆◆◆◇◇◇◇" },
      { label: "지식", value: "◆◆◆◆◆◇◇◇◇" },
      { label: "민첩", value: "◆◆◆◆◆◇◇◇◇" }
    ],
    skill: [
      { label: "마지막 구절", value: "머리를 가르는 선율이 퍼져나온다. 브라바! 골을 울리는 연주자여."},
      { label: "낙원의 칸타타", value: "두려워 말라, 이 선율은 상처를 아물고 피를 맑게 하며 영혼까지 치유할 것이다. 들어라! 이것이 낙원이다."}
    ],
    attack_types: "물리"
  },

  matiam: {
    name: "마티암 / Matiam",
    realname: "Matiam Crohi",
    color: characterColors.matiam.primary,
    title: "이거 정말 고민되는걸. 초상화에는 어느 부분이 나와야하지?",
    portrait: images.characters.matiam.portrait,

    appearance: {
      image: images.characters.matiam.full,
      description: `그는 그다지 친숙한 모습은 아니었다. 떼어놓고 보면 별다를 것 없었으나 붙여놓으니 문제였다. 안 그래도 새하얀 얼굴이 손에 가볍게 들려있으니 마치 시체와 같은 모습이었다. 그를 처음 본 사람은 꼭 두 번 놀란다. 그 모습에 한 번, 죽은 줄 알았던 얼굴이 태평하게 말을 걸 때 한 번.. 
        머리카락은 젖어버린 듯한 모습 그대로 말라붙어버렸다. 그렇게까지 악성 곱슬머리는 아니었지만 이리 구르고 저리 구르면서 피와 정체 모를 액체들이 묻어 그대로 마른 탓이었다. 목욕은 자주 하지만 머리가 깔끔해지기 무섭게 이런저런 이유로 더러워지는 모양이다. 아무래도, 계속 이렇게 들고 있으면 팔 저리니까 어딘가에 놓아둘 때가 많다.
        목은 칼과 같은 날카로운 것으로 깔끔하게 한 번에 자른 듯했다. 그의 목을 두 동강 낸 범인은 상당한 실력의 소유자였을 것이리라.
        `,
    },
    description: {
      job: "목 댕강 재봉사 / Headless Tailor",
      body: "머리를 제외하면 165cm / 잔근육이 있는 평균적인 몸",
      gender: " ",
      race: "훔",
      age: "33세",
      enlistment_period: "아마도 5년 전, 그러니까 목이 잘린 후 6개월이 채 지나지 않았을 무렵",
      personality: `인간적인, 당장 오늘을 사는, 계획적인, 추상적인, 가벼운

      그에 대해 설명하기 위해 가장 먼저 해야 할 말은 지극히 인간적이라는 점이었다. 감정적일 때가 많고, 얄미울 정도로 농담하기도 하지만 만약 그가 과묵한 성격이었다면 무서워서 아무도 말을 안 걸었을지도 모른다. 또 그가 평범한 모습이었다면 한 대만 때리고 싶은 사람들로 수두룩해 머리가 파였을 것이다. 무거움과 가벼움의 적절한 균형을 유지하고 있다. 예전에는 진지하고 과묵한 성격이라고 하던데.. 전혀 믿기지 않는다.

      마티암의 장점이자 단점은 신경 쓰지 않을 일은 정말 하나도 신경을 쓰지 않는다는 것이다. 말하자면 현재 하고 싶은, 혹은 해야 하는 1순위만 생각하는 편. 보는 사람에 따라선 여유로워 보인다고 느낄 수도 있다. 분명 오늘까지 해야 하는 건이 있어도 주전부리 먹다가, 샤워하고 꼼꼼히 말린 후 마을도 구경하고, 원단도 고르고 골라 산 후에야 그 일을 처리한다. 그래도 결국 기한 내에 확실하게 처리하는 게 신기할 따름. 머릿속에 나름대로 계획을 세우는 모양이다. 가끔 틀어져 버릴 때도 있지만..

      잘 대화하다가도 문득 떠오른 듯 추상적인 표현을 쓰곤 했다. 농담의 일환이라고도 볼 수 있다. 어쩔 수 없이 책을 많이 읽게 된 입장으로서 써먹기 괜찮은 구절이 있으면 기억해뒀다 적절한 상황에 써먹는다. 마법사들은 참, 뭐가 문제일까. 왜 그렇게 어려운 단어를 쓰는 거지? 같은 말도 덧붙여서 말이다.`,
      etc: `[안녕, 신참들.]
        그는 자신의 모습을 역겨워하지도, 애써 숨기려고 하지도 않았으나 매번 혼란의 중심에 서 있는 것은 사양이었다. 몇 번은 재밌지만 어디 갈 때마다 그러면 좀…
        그런 의미에서 베리 파수꾼단은 아주 좋은 직장이었다. 이리저리 돌아다니고, 몰려다니고. 후드를 쓴 채 아무 말도 하지 않으면 눈치채는 사람은 없었다. 하지만 이 세상에 완벽한 비밀이 어디 있겠는가. 그와 만나 대화했던 사람들이 소문을 과장되게 부풀리면서 그는 어느 순간 베리 파수꾼단의 숨겨진 인기스타가 되었다.
        “그 왜, 있잖아. 베리 파수꾼단의 듀라한.”
        “죽음을 몰고 다닌다는 말이 있더군.”
        “누가 잘못 본 것이라 결론 내려지지 않았었나?”
        “마물을 길들인 거라던데.”
        “예전에 대화해 본 적 있네. 호탕한 사내였지.”
        마티암은 그러한 소문에 개의치 않았지만, 자신을 바라보는 신입 베리들의 시선이 달라지자 마음을 바꿀 수밖에 없었다. 시체가 움직인다는 경악에서 소문이 사실이라는 놀라움으로 바뀌다니! 경외 어린 눈빛마저 서려 있는 그 모습을 보자니 극의 주인공이 된 것만 같은 기분이었다. 그래서 조금 더 체면을 차리게 되었다는 것은 올드비들만 아는 비밀이다.

        [진짜 베리 파수꾼단에서의 모습]
        옷차림에서 짐작할 수 있듯 그는 베리들의 찢어지고 해진 옷을 수선해주는 역할을 하고 있다. 실력은 나쁘지 않다. 거의 공짜로 해주는데 이 정도면 괜찮지. 다만 직물 종류와 실 색이 한정적이라 덧대는 경우엔 감쪽같이! 새 옷같이! 해주진 못한다. 그걸 원한다면 직접 재료를 들고 오시길.
        전투 실력은 나쁘지 않았다. 절도있는 동작은 아니었지만 마물과 싸울 때는 안성맞춤인 생활전투. 처음에는 더 형편없었지만 5년이나 파수꾼단에 몸담은 사람이다. 그의 진가는 마물마저 속이는 빠른 손짓에 있다. 또한, 다치거나 죽는 것이 두려워 주춤하는 새를 보이지 않는다. 죽음 방지 마법이 걸려있어도 반사적으로 피하려고 하기 마련인데, 그는 처음부터 죽지 않도록 태어난 사람처럼 검을 휘둘렀다. 죽음을 두려워하지 않는 것이 아니다. 그는 지금 상태에서 죽지 않는다고 “확신”한 것이다. 이것이 형편없는 검술로도 마물과 제법 잘 싸울 수 있던 이유였다.
        마물을 잡지 않고, 수선도 하지 않는 시간엔 보통 어디선가 구해 온 책을 읽고 있다. 이젠 필체만 봐도 베낀 사람이 누군지 알겠다고 한다. 이름도 어디 사는지도 모르긴 하지만, 어떤 책들의 필체가 같은지는 안다. 읽을 책이 다 떨어지면 레이피어나 장신구, 망치를 수건을 부드러운 옷감을 통해 광이 날 정도로 닦는다. 물건한테까지 깔끔을 떠는 성격은 아니지만, 이러고 있으면 심신이 안정된다고 한다. 갑옷도 좋아하지만 무거워서 입을 마음은 들지 않는다. 마을에 들를 때면 상점에 방문하는 것도 즐긴다. 사는 건 결국 거기서 거기지만.. 예쁜 바늘을 얻으면 좋아한다.


        [추론할 수 있는 그의 과거]
        지금부터 하는 말은 그가 술자리에서, 아니면 대화 중 흘리듯 말한 이야기를 조각조각 이어 붙인 것이다. 믿거나 말거나.
        그는 과거에 재봉사였다. 그러니까, 지금처럼 낡은 옷을 보수하거나 찢어진 부분에 천을 덧대 꿰매는 일이 아니라 진짜 옷을 만드는 사람이었다는 뜻이다. 그것도 꽤 잘 나가는 가게를 소유하고 있었다고.
        죽음 역시 재밋거리가 된 시대, 그는 어떠한 이유로 사형대에 오르게 되었다. 정확한 이유는 알려주지 않는다.. 라기보단 농담이 너무 심해 뭐가 진짜인지 모르겠다.
        아무튼.. 그는 자신의 잘못을 인정했고 참수형으로 명예롭게 죽음을 맞이하려 했으나 알 수 없는 사특한 저주로 인해 목이 잘려도 죽지 않았다. 그 경악할만한 모습에 마을에서 쫓겨나 베리 파수꾼단으로 들어오게 되었다는 이야기. 
        그걸 증명이라도 하듯 단장을 따라 이동할 때마다 어떠한 마도서를 찾고 있다. 어렵게 책을 구해서도 펼쳐본 후 생각한 내용이 아니면 그냥 버려버린다. 마도서를 좋아한다면 마티암에게 버릴 책을 달라고 하자.

        [호불호]
        호 - 금속제 제품을 반짝반짝하게 닦는 것, 바늘 수집
        불호 - 무거운 짐, 축축한 옷(특히 양말)
        `,
        belongings: `황동 레이피어 - 마물을 처치할 때 사용하는 무기이다. 관리를 잘하는지 항상 반짝거리기에 머리보다 그의 무기가 눈에 잘 들어온다는 사람도 있다. 거꾸로 잡아 들고 다니며 지팡이처럼 쓰곤 한다..
직물 모음 - 면, 우단, 실크조각 등.. 각각의 직물은 크기가 그리 크진 않지만, 수리를 위한 용도로는 안성맞춤이다. 가방을 따로 마련하지 않은 그는 셔츠와 겉옷 사이에 직물들을 넣고 다니곤 한다.
바늘, 실, 세공용 망치, 작업 장갑, 가위 - 이 역시 수리를 위해 들고 다닌다. 덧옷에 주렁주렁 매달려 있다.`
    },

    quotes: [
      "이거 정말 고민되는걸.",
      "초상화에는 어느 부분이 나와야하지?"
    ],
    weapon: images.characters.matiam.weapon,
    stats: [
      { label: "힘", value: "◆◆◆◆◇◇◇◇◇" },
      { label: "지식", value: "◆◆◆◆◆◆◆◇◇" },
      { label: "민첩", value: "◆◆◆◆◆◆◆◇◇" }
    ],
    skill: [
      { label: "머리 받아라!", value: "목 없는 재봉사에겐 두 손이 있다. 날아온 머리와 눈을 마주치면, 레이피어는 수선 못 할 상처를 남긴다."}
    ],
    attack_types: "민첩"
  },
};

export default characters;